
""" 
Задача 1

Створи програму:
 1) Запитує вік користувача
 2) Якщо вік < 12 — вивести 'Дитина'
 3) Якщо 12–17 — 'Підліток'
 4) Якщо >= 18 — 'Дорослий’
"""

age = int(input("Enter your age: "))

if age < 12:
    print("Дитина")
elif 12 <= age <= 17:
    print("Підліток")
else:
    print("Дорослий")





""" 
Задача 2

Умова:
Напиши програму, яка:
Запитує у користувача слово.
Зберігає його у змінну.
Перевіряє:
якщо слово "так" → вивести "Ви погодились"
якщо слово "ні" → вивести "Ви відмовились"
якщо слово "можливо" → вивести "Ви не визначились"
інакше → вивести "Невідома відповідь" """

answer = input()

if answer == "так":
    print("Ви погодилися!")
elif answer == "ні":
    print("Ви відмовилися!")
elif answer == "можилво":
    print("Ви не визначилися!")
else:
    print("Невідома відповідь!")
